app/views/meetings/index.html.haml

- @meetings.each do |m|
	.row.meeting{id: "class#{m.ordinal}"}
		.col-md-2
---
SELECT "meetings".* FROM "meetings"