app/controllers/meetings_controller.rb

	def show
		@meeting = Meeting.find(params[:id])
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT 1  [["id", "1"]]