app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)

		if @post.valid?
			@post.save!
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 14 Nov 2013 06:50:51 UTC +00:00], ["text", "It has some text, woohoo"], ["title", "A new post"], ["updated_at", Thu, 14 Nov 2013 06:50:51 UTC +00:00]]